reply_start = (
    "👋 Привет!\n\n"
    "Я бот, в котором вы можете посоревноваться с другими игроками в юморе!\n\n"
    "Рекомендуем ознакомиться с правилами игры:"
)

reply_game_rules =  (
        "📜 *Правила игры:*\n\n"
        "• Каждый день в 12 дня выбирается заготовка — начало шутки.\n"
        "• Вы можете дописать свою шутку на основе этой заготовки,\n"
        "• Затем вы можете лайкать шутки других игроков.\n"
        "• В конце дня определяется ТОП 5 лучших шуток!\n\n"
        "❗ У вас нет возможности лайкнуть свою шутку.\n"
        "❗ Запрещено отправлять оскорбления или нецензурные тексты."
)

reply_checking = "🕐 Проверяю на цензуру..."
reply_censorship_failed = "❗ Обнаружено несоответствие цензуре!"
reply_moderation_error = "⚠️ Произошла ошибка при проверке цензуры. Попробуйте ещё раз позже."
reply_meaningfulness_failed = "❗ Это не похоже на осмысленное начало шутки."


reply_joke_too_long = "❗ Ваша шутка слишком длинная! Пожалуйста, уложитесь в 128 символов."
reply_joke_updated = "🔄 Вы уже отправляли шутку! Мы обновили вашу последнюю версию. Спасибо! 👍"
reply_joke_saved = "✅ Спасибо за вашу шутку! Она сохранена! 🔥"
reply_confirm_replacement = ("⚠️ Замена шутки сбросит лайки и просмотры.\n"
                             "Продолжить?")


reply_prompt_failed = "❗ Ваша заготовка нарушает правила цензуры. Попробуйте другую."
reply_prompt_too_long = "❗ Ваша заготовка слишком длинная! Пожалуйста, уложитесь в 64 символа."
reply_enter_prompt = "✏️ Введите заготовку (начало шутки), которую хотите предложить:"
reply_prompt_saved = "✅ Ваша заготовка успешно предложена и, возможно, будет выбрана завтра!"
reply_prompt_updated = "♻️ Ваша заготовка обновлена и сохранена!"
reply_suggest_prompt = "✏️ Введите заготовку (начало шутки), которую хотите предложить:"



reply_admin_no_rights = "⛔ У вас нет прав на эту команду."
reply_admin_routine_start = "ADMIN MESSAGE: initiating routine sequence..."
reply_admin_routine_end = "ADMIN MESSAGE: routine sequence done"

reply_no_joke_for_stats = "😕 У вас пока нет отправленной шутки."

reply_notifications_unsub = ("Рассылка происходит ежедневно в 12:00 по МСК.\n"
                             "Под рассылкой подразумевается ежедневное уведомление о "
                             "победителях прошедшего дня и новой сегодняшней заготовке.\n"
                             "Отключив ее, вы не увидите топ-5 победителей!\n\n"
                             "🔕 Вы отписались от рассылки.")
reply_notifications_sub = "🔔 Вы подписались на рассылку."

reply_replace_joke_yes = "✅ Шутка обновлена! Лайки и просмотры сброшены."
reply_replace_joke_no = "❌ Отмена. Ваша шутка осталась прежней."

reply_voting_no_jokes = ("😕 Пока нет доступных шуток для голосования.\n(Или вы уже посмотрели все доступные шутки)\n\n"
                         "❗ Напоминаем, что у вас нет возможности голосовать за свою шутку и видеть ее в пуле для голосования!")
reply_voting_all_jokes_viewed = "✅ Вы просмотрели все шутки!"
reply_voting_finish = "✅ Спасибо за участие в голосовании!"

reply_no_winners_info = "😕 Пока нет данных о вчерашнем топе."