reply_checking = "🕐 Происходит проверка на цензуру..."

reply_censorship_failed = "❗ Обнаружено несоответствие цензуре!"

reply_joke_too_long = "❗ Твоя шутка слишком длинная! Пожалуйста, уложись в 128 символов."

reply_joke_updated = "🔄 Ты уже отправлял шутку! Мы обновили твою последнюю версию. Спасибо! 👍"

reply_joke_saved = "✅ Спасибо за твою шутку! Она сохранена! 🔥"

reply_moderation_error = "⚠️ Произошла ошибка при проверке цензуры. Попробуйте ещё раз позже."

reply_enter_prompt = "✏️ Введите заготовку (начало шутки), которую хотите предложить:"

reply_prompt_saved = "✅ Ваша заготовка успешно предложена и ожидает публикации!"

reply_prompt_failed = "❗ Ваша заготовка нарушает правила цензуры. Попробуйте другую."

reply_prompt_too_long = "❗ Твоя заготовка слишком длинная! Пожалуйста, уложись в 64 символа."

reply_confirm_replacement = ("⚠️ Замена шутки сбросит лайки и просмотры.\n"
                             "Продолжить?")

reply_prompt_updated = "♻️ Ваша заготовка обновлена и сохранена!"